#### HermiteSurface Members

---

|  |
| --- |
| HermiteSurface Class   Methods   Properties   See Also |

The  HermiteSurface  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Int32, Int32, IList XYZ ) | Create a non-periodic Hermite surface using a net of 3D points as input. |
| Public method Static member | Create(Int32, Int32, IList XYZ , Boolean, Boolean) | Create a Hermite surface using a net of 3D points as input. Specify periodicity in U and V direction. |
| Public method | Dispose | (Inherited from  Surface  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetBoundingBoxUV | Gets the UV bounding box of the surface. (Inherited from  Surface  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | IsValid | Checks whether this HermiteSurface object is valid. |
| Public method | Project | Project a 3D point orthogonally onto a surface (to find the nearest point). Throws InvalidOperationException if the projection fails. (Inherited from  Surface  .) |
| Public method | ProjectWithGuessPoint | Project a 3D point orthogonally onto a surface (to find the nearest point). This method is meant to be used when a good approximate solution for the projection is available. Throws InvalidOperationException if the projection fails. (Inherited from  Surface  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  Surface  .) |
| Public property | OrientationMatchesParametricOrientation | Indicates whether this Surface's orientation is the same as or opposite to its parametric orientation. (Inherited from  Surface  .) |

# See Also

HermiteSurface Class

Autodesk.Revit.DB Namespace